<details ><summary>plan for 01-terraform-infra_envs_staging_data 2026-02-28 12:34:33 (UTC)</summary>
          <details ><summary>Additional output for <b>k-napiontek/test#01-terraform-infra_envs_staging_data</b></summary>

```terraform
=== CHECKOV SECURITY REPORT ===
terraform_plan scan results:

Passed checks: 24, Failed checks: 6, Skipped checks: 0

Check: CKV_AWS_382: "Ensure no security groups allow egress from 0.0.0.0:0 to port -1"
	FAILED for resource: aws_security_group.rds
	File: /plan.json:0-0
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/bc-aws-382
Check: CKV_AWS_354: "Ensure RDS Performance Insights are encrypted using KMS CMKs"
	FAILED for resource: module.db.module.db_instance.aws_db_instance.this[0]
	File: /plan.json:0-0
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/bc-aws-354
Check: CKV_AWS_157: "Ensure that RDS instances have Multi-AZ enabled"
	FAILED for resource: module.db.module.db_instance.aws_db_instance.this[0]
	File: /plan.json:0-0
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/general-73
Check: CKV_AWS_129: "Ensure that respective logs of Amazon Relational Database Service (Amazon RDS) are enabled"
	FAILED for resource: module.db.module.db_instance.aws_db_instance.this[0]
	File: /plan.json:0-0
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-iam-policies/ensure-that-respective-logs-of-amazon-relational-database-service-amazon-rds-are-enabled
Check: CKV2_AWS_5: "Ensure that Security Groups are attached to another resource"
	FAILED for resource: aws_security_group.rds
	File: /plan.json:0-0
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-networking-policies/ensure-that-security-groups-are-attached-to-ec2-instances-or-elastic-network-interfaces-enis
Check: CKV2_AWS_30: "Ensure Postgres RDS as aws_db_instance has Query Logging enabled"
	FAILED for resource: module.db.module.db_instance.aws_db_instance.this[0]
	File: /plan.json:0-0
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-postgres-rds-has-query-logging-enabled

 

```
</details>

<details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS myapp"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/16",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "stg-myapp-rds-"
      + owner_id               = (known after apply)
      + region                 = "eu-central-1"
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "stg"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0ccd5675cc1814a10"
    }

  # module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "stg-myapp subnet group"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "stg-myapp-"
      + region                  = "eu-central-1"
      + subnet_ids              = [
          + "subnet-00535743bc98d715e",
          + "subnet-0c7e08f3aa66a750b",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "stg-myapp"
        }
      + tags_all                = {
          + "Environment" = "stg"
          + "Name"        = "stg-myapp"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
      + vpc_id                  = (known after apply)
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "myapp"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = true
      + id                                    = (known after apply)
      + identifier                            = "stg-myapp"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = 5432
      + publicly_accessible                   = false
      + region                                = "eu-central-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Environment" = "stg"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
      + timezone                              = (known after apply)
      + upgrade_rollout_order                 = (known after apply)
      + username                              = "dbadmin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "stg-myapp-rds-monitoring"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "stg-myapp-rds-monitoring"
        }
      + tags_all              = {
          + "Environment" = "stg"
          + "Name"        = "stg-myapp-rds-monitoring"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "stg-myapp-rds-monitoring"
    }

  # module.db.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id"                  = "stg-myapp"
          + "snapshot_identifier" = null
        }
    }

  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "stg-myapp parameter group"
      + family       = "postgres16"
      + id           = (known after apply)
      + name         = (known after apply)
      + name_prefix  = "stg-myapp-"
      + region       = "eu-central-1"
      + skip_destroy = false
      + tags         = {
          + "Name" = "stg-myapp"
        }
      + tags_all     = {
          + "Environment" = "stg"
          + "Name"        = "stg-myapp"
          + "Project"     = "myapp"
          + "Terraform"   = "true"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_instance_address                = (known after apply)
  + db_instance_endpoint               = (known after apply)
  + db_instance_master_user_secret_arn = (known after apply)
  + db_instance_name                   = "myapp"
  + db_instance_port                   = 5432
  + db_instance_username               = (sensitive value)
  + db_security_group_id               = (known after apply)

```
</details>


<details ><summary>Terraform plan validation check (01-terraform-infra_envs_staging_data)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                                       RESOURCE                                       |
|--------|--------------------------------------------------------------------------------------|
| add    | `aws_security_group.rds`                                                             |
|        | `module.db.module.db_instance.aws_db_instance.this[0]`                               |
|        | `module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]`                   |
|        | `module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]` |
|        | `module.db.module.db_instance.random_id.snapshot_identifier[0]`                      |
|        | `module.db.module.db_parameter_group.aws_db_parameter_group.this[0]`                 |
|        | `module.db_subnet_group.aws_db_subnet_group.this[0]`                                 |

| CHANGE |                OUTPUT                |
|--------|--------------------------------------|
| add    | `db_instance_address`                |
|        | `db_instance_endpoint`               |
|        | `db_instance_master_user_secret_arn` |
|        | `db_instance_name`                   |
|        | `db_instance_port`                   |
|        | `db_instance_username`               |
|        | `db_security_group_id`               |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p 01-terraform-infra_envs_staging_data
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>